<?php
$a = array(
  0 => 
  array (
    'id' => '6',
    'name' => 'люстра подвесная Ideal Lux Pavone SP6',
    'body' => 'имеют большую популярность и предназначаются для множества интерьеров, главное правильно выбрать подходящий вариант из категории. Если Вам нужно купить надежные и привлекательные. Хорошим выбором для обустройства вашего жилища будет подвесная люстра Ideal Lux Pavone SP6(Италия).Важно обратить внимание, люстра Pavone SP6 Ideal Lux соответствуем всем стандартам качества, это значит, вам не стоит переживать за надежность данного изделия, ведь люстра Pavone SP6 Pavone — сертифицированный продукт, прошедший все надлежащие проверки. Фабрика Ideal Lux очень тщательно следит за уровнем качества выпускаемой продукции. люстра Ideal Lux Pavone SP6 серии Pavone имеет соответствующий дизайн в стиле - арт-деко. Материал, используемый в модели Ideal Lux Pavone — это металл, а гармонично подобранные цвета дизайнерами фабрики Ideal Lux, из которых состоит люстра Pavone SP6 — это хром, бежевый. подвесная люстра Ideal Lux Pavone отлично подойдет как для спальни, так и для других помещений, исполненных в стиле арт-деко. люстра Pavone SP6 в среднем освещает помещение площадью 13.3 кв. м. Лампочек данная модель имеет 6xE14, общая мощность которых - 240 ватт. Показатель защиты от влаги - IP20. подвесная люстра Ideal LuxPavone SP6 удачно сочетает в себе внешний вид, выполненный в стиле арт-деко и функциональные данные. Что несомненно является преимуществом приятной покупки. Купить модель люстра Pavone SP6 производителя Ideal Lux за',
    'image' => 'http://sevenlight.ru/files/products/ideallux_pavonesp6.png',
  ),
  1 => 
  array (
    'id' => '7',
    'name' => 'люстра потолочная MW-Light 421013406',
    'body' => 'имеют большую популярность и предназначаются для множества интерьеров, главное правильно выбрать подходящий вариант из категории. Если Вам нужно купить надежные и привлекательные. Хорошим выбором для обустройства вашего жилища будет потолочная люстра MW-Light 421013406(Германия).Важно обратить внимание, люстра 421013406 MW-Light соответствуем всем стандартам качества, это значит, вам не стоит переживать за надежность данного изделия, ведь люстра 421013406 Букет — сертифицированный продукт, прошедший все надлежащие проверки. Фабрика MW-Light очень тщательно следит за уровнем качества выпускаемой продукции. люстра MW-Light 421013406 серии Букет имеет соответствующий дизайн в стиле - прованс. Материал, используемый в модели MW-Light Букет — это металл, а гармонично подобранные цвета дизайнерами фабрики MW-Light, из которых состоит люстра 421013406 — это белый, разноцветный. потолочная люстра MW-Light Букет отлично подойдет как для гостиной, так и для других помещений, исполненных в стиле прованс. люстра 421013406 в среднем освещает помещение площадью 13.3 кв. м. Лампочек данная модель имеет 6xE14, общая мощность которых - 240 ватт. Показатель защиты от влаги - IP20. потолочная люстра MW-Light421013406 удачно сочетает в себе внешний вид, выполненный в стиле прованс и функциональные данные. Что несомненно является преимуществом приятной покупки. Купить модель люстра 421013406 производителя MW-Light за',
    'image' => 'http://sevenlight.ru/files/products/mwlight_421013406.png',
  ),
  2 => 
  array (
    'id' => '8',
    'name' => 'люстра потолочная Citilux EL331C120.1',
    'body' => 'имеют большую популярность и предназначаются для множества интерьеров, главное правильно выбрать подходящий вариант из категории. Если Вам нужно купить надежные и привлекательные. Хорошим выбором для обустройства вашего жилища будет потолочная люстра Citilux EL331C120.1(Дания).Важно обратить внимание, люстра EL331C120.1 Citilux соответствуем всем стандартам качества, это значит, вам не стоит переживать за надежность данного изделия, ведь люстра EL331C120.1 Lavita — сертифицированный продукт, прошедший все надлежащие проверки. Фабрика Citilux очень тщательно следит за уровнем качества выпускаемой продукции. люстра Citilux EL331C120.1 серии Lavita имеет соответствующий дизайн в стиле - современный. Материал, используемый в модели Citilux Lavita — это металл, а гармонично подобранные цвета дизайнерами фабрики Citilux, из которых состоит люстра EL331C120.1 — это хром, прозрачный. потолочная люстра Citilux Lavita отлично подойдет как для больших залов, так и для других помещений, исполненных в стиле современный. люстра EL331C120.1 в среднем освещает помещение площадью 60 кв. м. Лампочек данная модель имеет 120xLED, общая мощность которых - 120 ватт. Показатель защиты от влаги - IP20. потолочная люстра CitiluxEL331C120.1 удачно сочетает в себе внешний вид, выполненный в стиле современный и функциональные данные. Что несомненно является преимуществом приятной покупки. Купить модель люстра EL331C120.1 производителя Citilux за',
    'image' => 'http://sevenlight.ru/files/products/citilux_el331c1201.png',
  ),
);
?>
<HTML>
	<BODY>
<pre>
<h1>This is table2ascii demo:</h1>
<?php print_r($a);?>
<h2>Array converted to ASCII table:</h2> 
<?php 
//class import
require_once(dirname(__FILE__).'/Table2ascii.php');
?>

<h2>Demo table max. width 170 chars:</h2>
<?php
//creating class for drawing tables with max. width 150 chars
$c = new Table2ascii(170);
print $c->draw($a);
?>

<h2>Demo table max. width 100 chars:</h2>
<?php
//creating class for drawing tables with max. width 100 chars
$c = new Table2ascii(100);
print $c->draw($a);
?>
</PRE>
</BODY>
</HTML>
